app/views/home/index.html.erb

    <div class="tab-pane active" id="tab1">
      <% @moods[0].sub_moods.each do |mood| %>
---
SELECT `sub_moods`.* FROM `sub_moods` WHERE `sub_moods`.`mood_id` IS NULL