app/controllers/home_controller.rb

  def index
    @moods = Mood.order 'name'
---
SELECT `sub_moods`.* FROM `sub_moods` WHERE `sub_moods`.`mood_id` IS NULL