app/controllers/moods_controller.rb

  def index
    @moods = Mood.all
---
SELECT `moods`.* FROM `moods`

  def show
    @mood = Mood.find(params[:id])
---
SELECT `moods`.* FROM `moods` WHERE `moods`.`id` = 2 LIMIT 1

  def edit
    @mood = Mood.find(params[:id])
---
SELECT `moods`.* FROM `moods` WHERE `moods`.`id` = 1 LIMIT 1

  def create
    @mood = Mood.new(params[:mood])

    respond_to do |format|
      if @mood.save
---
INSERT INTO `moods` (`created_at`, `description`, `mood_picture`, `name`, `updated_at`) VALUES ('2012-10-26 10:32:10', 'I am feeling glad', 'apple-touch-icon-114x114.png', 'Glad', '2012-10-26 10:32:10')

  def update
    @mood = Mood.find(params[:id])

    respond_to do |format|
      if @mood.update_attributes(params[:mood])
---
SELECT `moods`.* FROM `moods` WHERE `moods`.`id` = 1 LIMIT 1
UPDATE `moods` SET `mood_picture` = 'glad.png', `updated_at` = '2012-10-26 10:38:32' WHERE `moods`.`id` = 1

  def destroy
    @mood = Mood.find(params[:id])
    @mood.destroy
---
SELECT `sub_moods`.* FROM `sub_moods` WHERE `sub_moods`.`mood_id` = 6
DELETE FROM `moods` WHERE `moods`.`id` = 2