app/controllers/reasons_controller.rb

SELECT `reasons`.* FROM `reasons`
---
  def index
    @reasons = Reason.all

SELECT `reasons`.* FROM `reasons` WHERE `reasons`.`id` = 1 LIMIT 1
---
  def show
    @reason = Reason.find(params[:id])

INSERT INTO `reasons` (`created_at`, `name`, `updated_at`) VALUES ('2012-10-26 17:44:29', 'I am feeling so happy', '2012-10-26 17:44:29')
---
  def create
    @reason = Reason.new(params[:reason])

    respond_to do |format|
      if @reason.save