app/controllers/sub_moods_controller.rb

SELECT `sub_moods`.* FROM `sub_moods`
---
  def index
    @sub_moods = SubMood.all

SELECT `sub_moods`.* FROM `sub_moods` WHERE `sub_moods`.`id` = 1 LIMIT 1
---
  def show
    @sub_mood = SubMood.find(params[:id])

INSERT INTO `sub_moods` (`created_at`, `description`, `mood_id`, `name`, `sub_mood_picture`, `updated_at`) VALUES ('2012-10-26 15:29:19', '', 1, 'sdfasdf', NULL, '2012-10-26 15:29:19')
---
  def create
    @sub_mood = SubMood.new(params[:sub_mood])

    respond_to do |format|
      if @sub_mood.save

SELECT `sub_moods`.* FROM `sub_moods` WHERE `sub_moods`.`id` = 1 LIMIT 1
DELETE FROM `sub_moods` WHERE `sub_moods`.`id` = 1
---
  def destroy
    @sub_mood = SubMood.find(params[:id])
    @sub_mood.destroy